      *///////////////////////////////////////////////////////////////
      * Mel's Cargo
      * MCSTART:
      *   Displays the the Mel's Cargo splash screen
      *
      * AUTHOR:
      *   Philip Young aka Soldier of FORTRAN
      *
      * 09/17/2022
      * License GPL v3
      *///////////////////////////////////////////////////////////////
       IDENTIFICATION DIVISION.
       PROGRAM-ID.   MCSTART.
       AUTHOR. SOLDIER OF FORTRAN.
       INSTALLATION. DAMN VULNERABLE.
       DATE-WRITTEN. 09/17/2022.
       SECURITY. CONFIDENTIAL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WS-ABSTIME          PIC S9(15) COMP-3.
       77  RC                  PIC S9(4)  COMP.
       01  WTO-MESSAGE PIC X(38) VALUE SPACES.
       01  WS-COMM.
           05  ISEED           PIC S9(8) COMP.
           05  COLORS OCCURS 5 PIC X.
           05  HILITE OCCURS 5 PIC X.
      *
       COPY MCGMMS.
       COPY DFHAID.
       COPY DFHBMSCA.
       LINKAGE SECTION.
      *
       01  DFHCOMMAREA                       PIC X(14).
      *
       PROCEDURE DIVISION.
       MCGM-MAIN.
           MOVE 'Displaying MCGM transaction' TO WTO-MESSAGE.
           PERFORM WTO.

           IF EIBAID = DFHPF1
      *         EXEC KICKS XCTL PROGRAM('MCGMPGM') END-EXEC
                MOVE 'F1' TO WTO-MESSAGE
                PERFORM WTO.

           IF EIBCALEN = 0
                PERFORM SHOW-MCGM
           ELSE
           IF EIBCALEN NOT = 14
               EXEC CICS ABEND ABCODE('COMM') END-EXEC
           ELSE
                MOVE DFHCOMMAREA TO WS-COMM.

           IF EIBAID = DFHCLEAR OR DFHPF3
                EXEC CICS SEND CONTROL ERASE FREEKB END-EXEC
                EXEC CICS RETURN END-EXEC.

           IF EIBAID EQUAL TO DFHPF5
      *    Launch the main menu if a person hits F5
                EXEC CICS XCTL PROGRAM('MCMMENU') END-EXEC.

           EXEC CICS RETURN TRANSID('MCGM') COMMAREA(WS-COMM) END-EXEC.

       SHOW-MCGM.

           EXEC CICS SEND MAP('MCGMMAP') MAPSET('MCGMMS') ERASE
           END-EXEC.
      *
      * WRITES A MESSAGE TO THE CONSOLE
      *
       WTO SECTION.
           EXEC CICS WRITE OPERATOR
               TEXT(WTO-MESSAGE)
           END-EXEC.
           MOVE SPACES TO WTO-MESSAGE.
