      *///////////////////////////////////////////////////////////////
      * Mel's Cargo
      * SECRET:
      *   Show secret screen only for real hackers
      *
      * Vulnerabilities:
      *   This demonstrates that COBOL programmers have control over
      *   the Action IDentifiers (AID). To get here you have to press
      *   PA3 (which isnt on a keyboard). There's also a hidden easter
      *   egg here in the source.
      *
      * AUTHOR:
      *   Philip Young aka Soldier of FORTRAN
      *
      * 09/17/2022
      * License GPL v3
      *///////////////////////////////////////////////////////////////
       IDENTIFICATION DIVISION.
       PROGRAM-ID.   SECRET.
       AUTHOR. SOLDIER OF FORTRAN.
       INSTALLATION. DAMN VULNERABLE.
       DATE-WRITTEN. 09/17/2022.
       SECURITY. CONFIDENTIAL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * COMM AREA
       01  MC-COMMS.
           05 FILLER PIC X(14).
      * WTO MESSAGE STORAGE
       01  CONSOLE-MESSAGE.
           05  HEAD PIC X(5) VALUE 'MELSC'.
           05  MSG-NUM PIC 9(3) VALUE 000.
           05  FILLER PIC X VALUE ' '.
           05  TRANS-ID       PIC X(4).
           05  FILLER PIC X(3) VALUE ' - '.
           05  WTO-MESSAGE    PIC X(47) VALUE SPACES.
       01  RESPONSE-CODE  PIC S9(4) COMP.
      *
       COPY PA3MAP.
       COPY MEME.
       COPY DFHAID.
       COPY DFHBMSCA.
       LINKAGE SECTION.
      *
       01  DFHCOMMAREA                       PIC X(14).
      *
       PROCEDURE DIVISION.
       MAIN.
      *
           PERFORM HANDLE-AIDS.
           MOVE 'Starting SECRET' TO WTO-MESSAGE.
           PERFORM WTO.

           IF EIBCALEN > ZERO THEN
               MOVE DFHCOMMAREA TO MC-COMMS.


           IF EIBAID EQUAL TO DFHPF3
                MOVE 'JUST KIDDING ITS F5 TO EXIT BACK TO MAIN MENU' TO
                MESSAGEO
           ELSE
           IF EIBAID EQUAL TO DFHPF5
              MOVE 'Returning to main menu' TO WTO-MESSAGE
              PERFORM WTO
               EXEC CICS XCTL
                   PROGRAM('MCMMENU')
               END-EXEC.

           IF EIBAID EQUAL TO DFHPA1
               MOVE 'LOADING EASTER EGG' TO WTO-MESSAGE
               PERFORM WTO
               EXEC CICS SEND MAP('MEMEMAP')
                   MAPSET('MEME') ERASE
               END-EXEC

               EXEC CICS
                   RETURN TRANSID('SCRT')
                      COMMAREA(MC-COMMS)
               END-EXEC
           ELSE
               MOVE 'LOADING SECRET MAP' TO WTO-MESSAGE
               PERFORM WTO
    
               EXEC CICS SEND MAP('SECRTMP')
                   MAPSET('PA3MAP') ERASE
               END-EXEC
    
               EXEC CICS
                   RETURN TRANSID('SCRT')
                          COMMAREA(MC-COMMS)
               END-EXEC.


      *
      *    *************************************************************
      *
      * WRITES A MESSAGE TO THE CONSOLE
      *
       WTO.
           EXEC CICS WRITE OPERATOR
               TEXT(CONSOLE-MESSAGE)
           END-EXEC.
           MOVE SPACES TO WTO-MESSAGE.
      *
      * This function handles all the AIDs
      *
       HANDLE-AIDS.
           IF EIBAID = DFHENTER
               MOVE '** AID: ENTER' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHCLEAR
               MOVE '** AID: ENTER' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPA1
               MOVE '** AID: PA1' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPA2
               MOVE '** AID: PA2' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPA3
               MOVE '** AID: PA3' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF1
               MOVE '** AID: F1' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF2
               MOVE '** AID: F2' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF3
               MOVE '** AID: F3' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF4
               MOVE '** AID: F4' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF5
               MOVE '** AID: F5' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF6
               MOVE '** AID: F6' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF7
               MOVE '** AID: F7' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF8
               MOVE '** AID: F8' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF9
               MOVE '** AID: F9' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF10
               MOVE '** AID: F10' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF11
               MOVE '** AID: F11' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF12
               MOVE '** AID: F12' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF13
               MOVE '** AID: F13' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF14
               MOVE '** AID: F14' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF15
               MOVE '** AID: F15' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF16
               MOVE '** AID: F16' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF17
               MOVE '** AID: F17' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF18
               MOVE '** AID: F18' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF19
               MOVE '** AID: F19' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF20
               MOVE '** AID: F20' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF21
               MOVE '** AID: F21' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF22
               MOVE '** AID: F22' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF23
               MOVE '** AID: F23' TO WTO-MESSAGE
               PERFORM WTO
           ELSE
           IF EIBAID = DFHPF24
               MOVE '** AID: F24' TO WTO-MESSAGE
               PERFORM WTO.
      *    This does nothing but the compiler complains ending on an IF
           MOVE 0 TO RESPONSE-CODE.
